EDT/УТ/src/Documents/ФормированиеЭкипажей/ФормированиеЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеЭкипажей</name>
  <registerRecords>InformationRegister.СформированныеЭкипажи</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Экипажи</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Экспедитор</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СформированныеЭкипажи/СформированныеЭкипажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СформированныеЭкипажи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ФормированиеЭкипажей/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ЭкипажиТранспортПриИзмененииНаСервере(Транспорт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СформированныеЭкипажиСрезПоследних.Водитель КАК Водитель,
		|	СформированныеЭкипажиСрезПоследних.Экспедитор КАК Экспедитор
		|ИЗ
		|	РегистрСведений.СформированныеЭкипажи.СрезПоследних(
		|			,
		|			Регион = &Регион
		|				И Транспорт = &Транспорт) КАК СформированныеЭкипажиСрезПоследних";
	
	Запрос.УстановитьПараметр("Регион", Объект.Регион);
	Запрос.УстановитьПараметр("Транспорт", Транспорт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураРезультата = Новый Структура("Водитель, Экспедитор");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура ЭкипажиТранспортПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Экипажи.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекСтрока.Транспорт.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураРезультат = ЭкипажиТранспортПриИзмененииНаСервере(ТекСтрока.Транспорт);
	
	ЗаполнитьЗначенияСвойств(ТекСтрока, СтруктураРезультат);
	
КонецПроцедуры
